Examinator/src/Catalogs/ПодборкиСУЗ/ПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрезентация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбиратьЭлементыИзРубрикатора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификационнаяГруппировка</name>
    <type>
      <types>CatalogRef.КлассификационныеГруппировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьГруппыЭлементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКлассификатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтартовуюСтраницу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЭлементов</name>
    <type>
      <types>EnumRef.ВариантыПредставленияЭлементовПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СвернутьРазделы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНавигации</name>
    <type>
      <types>EnumRef.ТипыНавигацииПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГруппЭлементов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйРесурс</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыравниваниеСтартовогоРесурса</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияТестированийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСложностиПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСложностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТаймер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматТаймера</name>
    <type>
      <types>EnumRef.ФорматыТаймераСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйРесурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НумероватьСтраницы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредыдущиеПопытки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьОткрытыеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтоимостьВопроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьКомментарииВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияНаФинальнойСтранице</name>
    <type>
      <types>EnumRef.ИнформацияНаФинальнойСтраницеТестаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Презентация</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.РесурсыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/ВариантыПредставленияЭлементовПодборкиСУЗ/ВариантыПредставленияЭлементовПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПредставленияЭлементовПодборкиСУЗ</name>
  <enumValues>
    <name>Последовательно</name>
  </enumValues>
  <enumValues>
    <name>КлассификационнаяТаблица</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыНавигацииПодборкиСУЗ/ТипыНавигацииПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНавигацииПодборкиСУЗ</name>
  <enumValues>
    <name>Последовательно</name>
  </enumValues>
  <enumValues>
    <name>ВыпадающимМеню</name>
  </enumValues>
  <enumValues>
    <name>ВыпадающимСписком</name>
  </enumValues>
  <enumValues>
    <name>Переключатели</name>
  </enumValues>
  <enumValues>
    <name>Слайды</name>
  </enumValues>
  <enumValues>
    <name>НаОднойСтранице</name>
  </enumValues>
  <enumValues>
    <name>БезНавигации</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ПодборкиСУЗ/Forms/ФормаТеории/Module.bsl
&НаКлиенте
Перем ОписаниеДопустимыхТиповПеретаскивания; // Типы, которые можно перетаскивать в курс

#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлектронныйРесурс = Параметры.ЭлектронныйРесурс;
	ЭлементСодержания = Параметры.ЭлементСодержания;
	
	РазработкаСУЗ.УстановитьРодителяНовогоОбъекта(Объект, Параметры, "СправочникСсылка.ПодборкиСУЗ");
	
	//////////////////////////////////////////////////////////////////
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	
	// Устанавливаем доступность данных от поставщика
	
	ТаблицаДоступностиДанныхПоставщика = РазработкаСУЗ.ПолучитьТаблицуДоступностиДанныхПоставщика();

	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.ЭлементыПодборки;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект, ТаблицаДоступностиДанныхПоставщика);
	
	//////////////////////////////////////////////////////////////////	
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек <> Неопределено Тогда
		ПоказыватьДополнительныеТипыНавигации = ДанныеНастроек.Получить("ПоказыватьДополнительныеТипыНавигации");
	КонецЕсли;	
	
	УстановитьЗаголовок();
	УстановитьРеквизиты();
	УстановитьОтборы();
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазработкаСУЗКлиент.УстановитьКонтекстЭлектронногоРесурса(ЭтотОбъект);
	
	Элементы.ЭлементыПодборкиСоздатьДокумент.Видимость = РазработкаСУЗКлиент.ЕстьПоддержкаДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьЗаголовок();
	УстановитьРеквизиты();
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
		Справочники.СодержаниеСУЗ.Перезаписать(ЭлементСодержания);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьОтборы();
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбъектСУЗЗаписан", Объект.Ссылка, ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Оповестить("ЭлектронныйРесурсОбновлен", ЭлектронныйРесурс, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПодборкаОбновлена" И Источник <> ЭтотОбъект Тогда
		Элементы.ЭлементыПодборки.Обновить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПоказыватьКлассификаторПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеЭлементовПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьСтартовуюСтраницуПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьДополнительныеТипыНавигацииПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭлементыПодборки

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ЭлементыПодборки

&НаКлиенте
Процедура ЭлементыПодборкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбщегоНазначенияСУКлиент.ПередВыборомЭлементаПодчиненногоСправочника(ЭтотОбъект, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		СтандартнаяОбработка = Ложь;
		
		РедактироватьЭлементПодборки();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЭлементыПодборкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыПодборкиОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(НовыйОбъект) И ТипЗнч(НовыйОбъект) <> Тип("СправочникСсылка.ЭлементыПодборкиСУЗ") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ВыделеннаяГруппа = ОбщегоНазначенияСУКлиент.ВыделеннаяГруппаТаблицы(Элементы.ЭлементыПодборки);
		
		ПоместитьЭлементВПодборку(Объект.Ссылка, НовыйОбъект, ВыделеннаяГруппа);
		
		Элементы.ЭлементыПодборки.Обновить();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЭлементыПодборкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) И ТипЗнч(ВыбранноеЗначение) <> Тип("СправочникСсылка.ЭлементыПодборкиСУЗ") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ВыделеннаяГруппа = ОбщегоНазначенияСУКлиент.ВыделеннаяГруппаТаблицы(Элементы.ЭлементыПодборки);
		
		ПоместитьЭлементВПодборку(Объект.Ссылка, ВыбранноеЗначение, ВыделеннаяГруппа);
		
		Элементы.ЭлементыПодборки.Обновить();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЭлементыПодборкиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	РазработкаСУЗКлиент.ОбработатьСобытиеПроверкаПеретаскивания(ПараметрыПеретаскивания, ОписаниеДопустимыхТиповПеретаскивания, СтандартнаяОбработка); 
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыПодборкиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	РазработкаСУЗКлиент.ОбработатьСобытиеПеретаскивание(ПараметрыПеретаскивания, ОписаниеДопустимыхТиповПеретаскивания, СтандартнаяОбработка, Строка, Объект.Ссылка, Элементы.ЭлементыПодборки, ЭтотОбъект);
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Добавление элементов из ранее созданных

&НаКлиенте
Процедура ДобавитьРанееСозданныйЭлемент(ИмяТаблицы, ПараметрыФормы=Неопределено)
	РазработкаСУЗКлиент.ДобавитьЭлементВТаблицуСУЗ(ЭтотОбъект, Элементы.ЭлементыПодборки, ИмяТаблицы, ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВопрос(Команда)
	ДобавитьРанееСозданныйЭлемент("ВопросыСУЗ");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтраницу(Команда)
	ДобавитьРанееСозданныйЭлемент("СтраницыСУЗ");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	ДобавитьРанееСозданныйЭлемент("РесурсыСУЗ");
КонецПроцедуры

// Создание элементов

&НаКлиенте
Процедура СоздатьЭлемент(ИмяЭлемента)
	РазработкаСУЗКлиент.СоздатьЭлементТаблицыСУЗ(ЭтотОбъект, Элементы.ЭлементыПодборки, ИмяЭлемента, ЭлектронныйРесурс, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВопрос(Команда)
	СоздатьЭлемент("Вопрос");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСтраницу(Команда)
	СоздатьЭлемент("Страница");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФайл(Команда)
	СоздатьЭлемент("Файл");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	СоздатьЭлемент("Документ");
КонецПроцедуры


// Общее для элементов

&НаКлиенте
Процедура РедактироватьЭлементПодборки()
	РазработкаСУЗКлиент.РедактироватьЭлементТаблицыСУЗ(Элементы.ЭлементыПодборки, "СсылкаНаОбъектСУЗ", ЭлектронныйРесурс, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЭлемент(Команда)
	РедактироватьЭлементПодборки();
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВверх(Команда)
	РазработкаСУЗКлиент.ПереместитьЭлемент("Вверх", Элементы.ЭлементыПодборки);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВниз(Команда)
	РазработкаСУЗКлиент.ПереместитьЭлемент("Вниз", Элементы.ЭлементыПодборки);
КонецПроцедуры

// Загрузка

&НаКлиенте
Процедура ЗагрузитьФайлы(Команда)
	РазработкаСУЗКлиент.ЗагрузитьЭлементыВТаблицуСУЗ(ЭтотОбъект, Элементы.ЭлементыПодборки, ЭлектронныйРесурс, Объект.Ссылка);
КонецПроцедуры

// Зависимые

&НаКлиенте
Процедура СкрытыеРесурсыОткрыть(Команда)
	
	ТекущиеДанные = Элементы.СкрытыеРесурсы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Ресурс) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ОткрытьФормуФайла", Истина);
		
		ОбщегоНазначенияСУКлиент.ОткрытьЗначениеВФорме(ТекущиеДанные.Ресурс, ПараметрыФормы, Элементы.СкрытыеРесурсы);
		
	Иначе
		
		ПоказатьЗначение(,ТекущиеДанные.Ресурс);
		
	КонецЕсли;
	
	
КонецПроцедуры


// Дополнительно

&НаКлиенте
Процедура КлассификаторЭлементовПодборок(Команда)
	ОткрытьФорму("Справочник.КлассификаторОбъектовСУЗ.ФормаСписка");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если Элементы.Найти("ЭлементыПодборкиКласс") <> Неопределено Тогда
		Элементы.ЭлементыПодборкиКласс.Видимость = Объект.ПоказыватьКлассификатор;
	КонецЕсли;
	
	Если Объект.ПредставлениеЭлементов = ПредопределенноеЗначение("Перечисление.ВариантыПредставленияЭлементовПодборкиСУЗ.КлассификационнаяТаблица") Тогда
		Элементы.ПоказыватьКлассификатор.ТолькоПросмотр = Истина;
		Элементы.СвернутьРазделы.ТолькоПросмотр         = Истина;
	Иначе
		Элементы.ПоказыватьКлассификатор.ТолькоПросмотр = Ложь;
		Элементы.СвернутьРазделы.ТолькоПросмотр         = Ложь;
	КонецЕсли;
	
	Если НЕ Объект.ПоказыватьСтартовуюСтраницу Тогда
		Элементы.ВыравниваниеСтартовогоРесурса.ТолькоПросмотр = Ложь;
		Элементы.СтартовыйРесурс.ТолькоПросмотр               = Ложь;
	Иначе
		Элементы.ВыравниваниеСтартовогоРесурса.ТолькоПросмотр = Истина;
		Элементы.СтартовыйРесурс.ТолькоПросмотр               = Истина;
	КонецЕсли;
	
	// Тип навигации
	
	Если ПоказыватьДополнительныеТипыНавигации Тогда
		
		Элементы.ТипНавигации.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив());
		
	Иначе		

		МассивТиповНавигации = Новый Массив();
		МассивТиповНавигации.Добавить(Перечисления.ТипыНавигацииПодборкиСУЗ.ВыпадающимСписком);
		МассивТиповНавигации.Добавить(Перечисления.ТипыНавигацииПодборкиСУЗ.НаОднойСтранице);
		
		МассивПараметровВыбора = Новый Массив();
		
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("ИсключитьЗначения", Новый ФиксированныйМассив(МассивТиповНавигации)));
		Элементы.ТипНавигации.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		
	КонецЕсли;	
	
	// Для веб-кабинета
	
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета = Новый Массив;
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.СтраницаНастройки);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ПоказыватьДополнительныеТипыНавигации);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.Шаблон);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ЭлементыПодборкиСоздатьВопрос);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ЭлементыПодборкиДобавитьВопрос);
	
	РазработкаСУЗ.УбратьВидимостьНеподдерживаемыхПлееромВебКабинетаЭлементов(ЭлектронныйРесурс, МассивЭлементовНеподдерживаемыхПлееромВебКабинета);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборы()

	// Отборы
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ЭлементыПодборки, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРеквизиты()

	// Реквизиты
	
	Справочники.ПодборкиСУЗ.УстановитьОбязательныеРеквизиты(Объект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовок()
	
	Если Объект.Ссылка.Пустая() Тогда
		Заголовок = НСтр("ru = 'Теория (создание)'");
	Иначе
		Заголовок = НСтр("ru = 'Теория ""%1""'");
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Заголовок, Объект.Наименование);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьЭлементВПодборку(Подборка, Элемент, ГруппаЭлементов)
	
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Элемент) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
		Элемент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент, "Владелец"); // Прикрепляем ресурс, а не файл
	КонецЕсли;
	
	Справочники.ПодборкиСУЗ.ДобавитьЭлементВПодборку(Подборка, Элемент, ГруппаЭлементов);
	
КонецПроцедуры


#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ОписаниеДопустимыхТиповПеретаскивания = Новый ОписаниеТипов("Файл");
